In [ ]:
#import pandas as pd data = {'Name': ['John', 'Jane', 'Jim', 'Joan'], 'Age': [25, 30, 35, 40], 'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']} df = pd.DataFrame(data) print(df.loc[0])

In [30]:
data=[4,8,15,16,23,42]

In [34]:
np.array([4,8,15,16,23,42])

array([ 4,  8, 15, 16, 23, 42])

In [36]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [42]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.
list=['a','b','c','d','e','f','g','h','i','j']
pd.Series(list)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [46]:
#Q3. Create a Pandas DataFrame that contains the following data:
"""Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female"""
data={"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":["F","M","F"]}
df=pd.DataFrame(data)
df

     Name  Age Gender
0   Alice   25      F
1     Bob   30      M
2  Claire   27      F

In [47]:
"""Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example."""

"""In short, a DataFrame in pandas is a two-dimensional data structure that represents tabular data, consisting of rows and columns. It is like a spreadsheet or SQL table. A Series, on the other hand, is a one-dimensional labeled array representing a single column or row of data. It is similar to a single column in a DataFrame or a single column in a spreadsheet."""

'In short, a DataFrame in pandas is a two-dimensional data structure that represents tabular data, consisting of rows and columns. It is like a spreadsheet or SQL table. A Series, on the other hand, is a one-dimensional labeled array representing a single column or row of data. It is similar to a single column in a DataFrame or a single column in a spreadsheet.'

In [ ]:
What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
we can do lots of thing in pandas like we can create dataframe , update it , drop it , drop it prmamently , dorp any columns in pandas etc are the basic function avlibal in pandas to manuplat data frame in pandas.

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
in panel data and size is mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [60]:
a1=pd.Series([14,58,115,516,123,542])
a2=pd.Series([24,48,215,416,223,442])
a3=pd.Series([34,38,315,316,323,342])
a4=pd.Series([44,28,415,216,423,242])
a5=pd.Series([54,18,515,116,523,142])
df=pd.concat([a1,a2,a3,a4,a5],axis=1)
df

     0    1    2    3    4
0   14   24   34   44   54
1   58   48   38   28   18
2  115  215  315  415  515
3  516  416  316  216  116
4  123  223  323  423  523
5  542  442  342  242  142